{"data":{"markdownRemark":{"html":"<div class=\"content\">\n<p>Kurssilla tutustutaan Javascriptilla tapahtuvaan moderniin websovelluskehitykseen. Pääpaino on React-kirjaston avulla toteutettavissa single page -sovelluksissa, ja niitä tukevissa Node.js:llä toteutetuissa REST-rajapinnoissa.</p>\n<p>Kurssilla käsitellään myös sovellusten testaamista, konfigurointia ja suoritusympäristöjen hallintaa sekä NoSQL-tietokantoja.</p>\n<h3>Oletetut esitiedot</h3>\n<p>Osallistujilta edellytetään vahvaa ohjelmointirutiinia, web-ohjelmoinnin ja tietokantojen perustuntemusta, git-versionhallintajärjestelmän peruskäytön hallintaa, kykyä pitkäjänteiseen työskentelyyn sekä valmiutta omatoimiseen tiedonhakuun ja ongelmanratkaisuun.</p>\n<p>Osallistuminen ei kuitenkaan edellytä kurssilla käsiteltävien tekniikoiden tai Javascript-kielen hallintaa.</p>\n<h3>Kurssimateriaali</h3>\n<p>Kurssimateriaali on tarkoitettu luettavaksi osa kerrallaan \"alusta loppuun\". Materiaalin seassa on tehtäviä, jotka on sijoiteltu siten, että kunkin tehtävän tekemiseen pitäsi olla riittävät tekniset valmiudet sitä edeltävässä materiaalissa. Voit siis tehdä tehtäviä sitä mukaan kun niitä tulee materiaalissa vastaan. Voi myös olla, että koko osan tehtävät kannattaa tehdä vasta sen jälkeen, kun olet ensin lukenut osan alusta loppuun kertaalleen. Useissa osissa tehtävät ovat samaa ohjelmaa laajentavia pienistä osista koostuvia kokonaisuuksia. Muutamia tehtävien ohjelmia kehitetään eteenpäin useamman osan aikana.</p>\n<p>Materiaali perustuu muutamien osasta osaan vaihtuvien esimerkkiohjelmien asteittaiseen laajentamiseen. Materiaali toiminee parhaiten, jos kirjoitat samalla koodin myös itse ja teet koodiin myös pieniä modifikaatioita. Materiaalin käyttämien ohjelmien koodin eri vaiheiden tilanteita on tallennettu GitHubiin.</p>\n<h3>Suoritustapa</h3>\n<p>Kurssi koostuu kahdeksasta osasta, joista ensimmäinen on historiallisista syistä numero nolla. Osat voi tulkita löyhästi ajatellen viikoiksi. Osia kuitenkin ilmestyy nopeampaa tahtia, ja suoritusnopeuskin on melko vapaa.</p>\n<p>Materiaalissa osasta <i>n</i> osaan <i>n+1</i> eteneminen ei ole mielekästä ennen kuin riittävä osaaminen osan <i>n</i> asioista on saavutettu. Kurssilla sovelletaankin pedagogisin termein <i>tavoiteoppimista</i>, <a href=\"https://en.wikipedia.org/wiki/Mastery_learning\">engl. mastery learning</a> ja on tarkoitus, että etenet seuraavaan osaan vasta, kun riittävä määrä edellisen osan tehtävistä on tehty.</p>\n<p>Oletuksena on, että teet kunkin osan tehtävistä <i>ainakin ne</i> jotka eivät ole merkattu tähdellä. Myös tähdellä merkatut tehtävät vaikuttavat arvosteluun, mutta niiden tekemättäjättäminen ei aiheuta liian suuria esteitä seuraavan osan (tähdellä merkkaamattomien) tehtävien tekemiseen.</p>\n<p>Osien <strong>deadlinet</strong> ovat maanantaisin klo 23:59, poikkeuksena kaksi viimeistä osaa, joiden deadline on sunnuntaina klo 23:59.</p>\n<table>\n<thead>\n<tr>\n<th>osa</th>\n<th align=\"center\">deadline   </th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>osa 0</td>\n<td align=\"center\">ma 21.1.</td>\n</tr>\n<tr>\n<td>osa 1</td>\n<td align=\"center\">ma 28.1.</td>\n</tr>\n<tr>\n<td>osa 2</td>\n<td align=\"center\">ma 4.2.</td>\n</tr>\n<tr>\n<td>osa 3</td>\n<td align=\"center\">ma 11.2.</td>\n</tr>\n<tr>\n<td>osa 4</td>\n<td align=\"center\">ma 18.2.</td>\n</tr>\n<tr>\n<td>osa 5</td>\n<td align=\"center\">ma 25.2.</td>\n</tr>\n<tr>\n<td>osa 6</td>\n<td align=\"center\">su 10.3.</td>\n</tr>\n<tr>\n<td>osa 7</td>\n<td align=\"center\">su 10.3.</td>\n</tr>\n</tbody>\n</table>\n<p>Tämän kurssin eri osiin jo tehtyjen palautusten ajankäyttöstatistiikan näet <a href=\"https://studies.cs.helsinki.fi/courses/#fullstack2019\">tehtävien palautussovelluksesta</a>.</p>\n<h3>Arvosteluperusteet</h3>\n<p>Kurssin oletusarvoinen laajuus on 5 opintopistettä. Arvosana määräytyy kaikkien tehtyjen tehtävien perusteella, myös tähdellä merkityt \"vapaavalintaiset\" tehtävät siis vaikuttavat arvosanaan. Noin 50% deadlineen mennessä tehdyistä tehtävistä tuo arvosanan 1 ja 80% arvosanan 5. Kurssin lopussa on koe, joka on suoritettava hyväksytysti. Koe ei kuitenkaan vaikuta arvosanaan.</p>\n<p>Koe pidetään tiistaina 5.3. klo 9 saleissa A111 ja B123. </p>\n<p>Kurssilta on mahdollisuus ansaita lisäopintopisteitä. Jos teet 87.5% kurssin tehtävistä, saat yhden lisäopintopisteen. Tekemällä 95% tehtävistä saat 2 lisäopintopistettä.</p>\n<h3>Arvosanarajat</h3>\n<p>Tarkemmat arvosanarajat määritellään siinä vaiheessa kun kurssin tehtävien yhteenlaskettu määrä on selvillä.</p>\n<h3>Aiemmin suoritetun kurssin täydentäminen</h3>\n<p>Jos olet suorittanut kurssin vuonna 2018 alle 7 opintoviikon laajuisena, voit täydentää nyt suoritustasi. Käytännössä täydentäminen tapahtuu siten, että voit korvata tämän kurssin <i>osia</i> viime vuonna suorittamasi kurssin aikana palauttamillasi osilla. Eli jos olet suorittanut kurssin esim. avoimen yliopiston kautta kolmen opintopisteen laajuisena, voit korvata vanhan suorituksesi osilla 0-3 tämän kurssin osat 0-3. </p>\n<p>Voit korvata ainoastaan kokonaisia osia, eli jos teit viime vuonna esim. 50% jonkin osan tehtävistä, et voi tällä kurssilla jatkaa samaa osaa. Viime vuotisten osien \"hyväksiluku\" tapahtuu tehtävien palautussovelluksella</p>\n<h3>Tehtävien palauttaminen</h3>\n<p>Tehtävät palautetaan GitHubin kautta ja merkitsemällä tehdyt tehtävät <a href=\"https://studies.cs.helsinki.fi/courses/#fullstack2019\">palautussovellukseen</a>.</p>\n<p>Jos palautat eri osien tehtäviä samaan repositorioon, käytä järkevää hakemistojen nimentää. Voit toki tehdä jokaisen osan omaankin repositorioon, kaikki käy.</p>\n<p>Tehtävät palautetaan <strong>yksi osa kerrallaan</strong>. Kun olet palauttanut osan tehtävät, et voi enää palauttaa saman osan tekemättä jättämiäsi tehtäviä.</p>\n<p>GitHubiin palautettuja tehtäviä tarkastetaan <a href=\"https://theory.stanford.edu/~aiken/moss/\">MOSS</a>-plagiaattitunnistusjärjestelmän avulla. Jos GitHubista löytyy kurssin mallivastausten koodia tai useammalta opiskelijalta löytyy samaa koodia, käsitellään tilanne yliopiston <a href=\"https://blogs.helsinki.fi/alakopsaa/opettajalle/epailen-opiskelijaa-vilpista-mita-tehda/\">vilppikäytäntöjen</a> mukaan.</p>\n<p>Suurin osa tehtävistä on moniosaisia, samaa ohjelmaa pala palalta rakentavia kokonaisuuksia. Tälläisissä tehtäväsarjoissa ohjelman lopullisen version palauttaminen riittää, voit toki halutessasi tehdä commitin jokaisen tehtävän jälkeisestä tilanteesta, mutta se ei ole välttämätöntä.</p>\n<h3>Alkutoimet</h3>\n<p>Tällä kurssilla suositellaan Chrome-selaimen käyttöä, sillä se tarjoaa parhaan välineistön web-sovelluskehitystä ajatellen.</p>\n<p>Kurssin tehtävät palautetaan GitHubiin, joten Git tulee olla asennettuna ja sitä on syytä osata käyttää. Ohjeita Gitin käyttämiseen löytyy muunmuassa <a href=\"https://github.com/mluukkai/ohjelmistotekniikka2018/blob/master/tehtavat/viikko1.md#gitin-alkeet\">täältä</a>.</p>\n<p>Asenna myös joku järkevä web-devausta tukeva tekstieditori, enemmän kuin suositeltava valinta on <a href=\"https://code.visualstudio.com/\">Visual studio code</a>.</p>\n<p>Älä koodaa nanolla, Notepadilla tai Geditillä. Myöskään NetBeans ei ole omimmillaan Web-devauksessa ja se on myös turhan raskas verrattuna esim. Visual Studio Codeen.</p>\n<p>Asenna koneeseesi heti myös <a href=\"https://nodejs.org/en/\">Node.js</a>. Materiaali on tehty versiolla 10.0, älä asenna mitään sitä vanhempaa versiota, kaiken tosin pitäisi toimia jos konellasi on Nodesta vähintään versio 8.0. Asennusohjeita on koottu <a href=\"https://github.com/fullstack-hy2019/misc/tree/master\">tänne</a>.</p>\n<p>Noden myötä koneelle asentuu myös Node package manager <a href=\"https://www.npmjs.com/get-npm\">npm</a>, jota tulemme tarvitsemaan kurssin aikana aktiivisesti. Tuoreen noden kera asentuu myös <a href=\"https://www.npmjs.com/package/npx\">npx</a>, jota tarvitaan myös muutaman kerran.</p>\n<h3>Typoja materiaalissa</h3>\n<p>Jos löydät kirjoitusvirheen tai jokin asia on ilmaistu epäselvästi tai kielioppisääntöjen vastaisesti, tee <i>pull request</i> repositoriossa <a href=\"https://github.com/fullstack-hy2019/fullstack-hy2019.github.io\">https://github.com/fullstack-hy2019/fullstack-hy2019.github.io</a> olevaan kurssimateriaaliin. Esim. tämän sivun markdown-muotoinen lähdekoodi löytyy repositorion alta osoitteesta <a href=\"https://github.com/fullstack-hy2019/fullstack-hy2019.github.io/blob/source/src/content/osa0/osa0a.md\">https://github.com/fullstack-hy2019/fullstack-hy2019.github.io/blob/source/src/content/osa0/osa0a.md</a></p>\n<p>Materiaalin jokaisen osan alalaidassa on linkki <em>Ehdota muutosta materiaalin sisältöön</em>, jota klikkaamalla pääset suoraan editoimaan sivun lähdekoodia.</p>\n</div>","frontmatter":{"mainImage":{"publicURL":"/static/part-0-ead92e4122923cfd78b71d8203d93388.svg"},"part":0,"letter":"a"}}},"pageContext":{"part":0,"letter":"a"}}